Core/src/DataProcessors/РабочееМестоКладовщика/РабочееМестоКладовщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочееМестоКладовщика</name>
</mdclass:DataProcessor>

Core/src/AccumulationRegisters/Запасы/Запасы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Запасы</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КоррСтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррХарактеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррПартия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСпецификация</name>
    <type>
      <types>CatalogRef.Спецификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПродажи</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.СписаниеЗапасов</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПеремещениеЗапасов</types>
      <types>DocumentRef.ЧекККМВозврат</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.СписаниеТопливаЗапасов</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ПересортицаЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиксированнаяСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатратыНаВыпуск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПеремещениеВРозницуСуммовойУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Резервирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>КоррДокументПоступления</name>
    <comment>ONESOFT-3602, ONESOFT-3713</comment>
    <type>
      <types>DefinedType.ДокументПоступленияДляFIFO</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчета</name>
    <comment>- устаревшее измерение - не заполнять</comment>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетУчетаЗатратРегл</name>
    <comment>- устаревшее измерение - не заполнять</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyАналитикаКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНаименованияПоставщиков</name>
    <type>
      <types>CatalogRef.AzRyНаименованияПоставщиков</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyКонтрагенты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyНоменклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПартииНоменклатуры</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПоступления</name>
    <comment>ONESOFT-3602</comment>
    <type>
      <types>DefinedType.ДокументПоступленияДляFIFO</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/AccumulationRegisters/ЗапасыНаСкладах/ЗапасыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗапасыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.Ячейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/Enums/ВидыОперацийПеремещениеЗапасов/ВидыОперацийПеремещениеЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПеремещениеЗапасов</name>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>СписаниеНаРасходы</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>СписаниеТаваровНаОС</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ПоложениеРеквизитаНаФорме/ПоложениеРеквизитаНаФорме.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоложениеРеквизитаНаФорме</name>
  <enumValues>
    <name>ВШапке</name>
  </enumValues>
  <enumValues>
    <name>ВТабличнойЧасти</name>
  </enumValues>
</mdclass:Enum>

Core/src/DataProcessors/РабочееМестоКладовщика/Forms/РабочееМестоКладовщика/Module.bsl
&НаКлиенте
Перем старыйПолучатель;

&НаКлиенте
Процедура Обновить(Команда)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	ОбновитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОбновитьНаСервере()
	
	Запрос = Новый Запрос;
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ЗапасыОстатки.СтруктурнаяЕдиница КАК Склад,
	//			   |	ЗапасыОстатки.ЗаказПокупателя КАК Заказ,
	//			   |	ЗапасыОстатки.Номенклатура,
	//			   |	ЗапасыОстатки.КоличествоОстаток КАК Количество,
	//			   |	ЗапасыОстатки.ЗаказПокупателя.СтруктурнаяЕдиницаРезерв КАК Получатель,
	//			   |	ЗапасыОстатки.Характеристика
	//			   |ИЗ
	//			   |	РегистрНакопления.Запасы.Остатки(, СтруктурнаяЕдиница В (&СписокСкладов)) КАК ЗапасыОстатки
	//			   |ГДЕ
	//			   |	ТИПЗНАЧЕНИЯ(ЗапасыОстатки.ЗаказПокупателя) = ТИП(Документ.ЗаказПокупателя)
	//			   |	И НЕ ЗапасыОстатки.ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	//			   |	И ЗапасыОстатки.КоличествоОстаток > 0
	//			   |	И ЗапасыОстатки.СтруктурнаяЕдиница <> ЗапасыОстатки.ЗаказПокупателя.СтруктурнаяЕдиницаРезерв
	//			   |
	//			   |УПОРЯДОЧИТЬ ПО
	//			   |	Склад,
	//			   |	Получатель,
	//			   |	Заказ";
				   
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗапасыОстатки.СтруктурнаяЕдиница КАК Склад,
	               |	ЗапасыОстатки.ЗаказПокупателя КАК Заказ,
	               |	ЗапасыОстатки.Номенклатура,
	               |	ЗапасыОстатки.КоличествоОстаток КАК Количество,
	               |	ЗапасыОстатки.ЗаказПокупателя.СтруктурнаяЕдиницаРезерв КАК Получатель,
	               |	ЗапасыОстатки.Характеристика
	               |ПОМЕСТИТЬ ВТ_Заказы
	               |ИЗ
	               |	РегистрНакопления.Запасы.Остатки(
	               |			,
	               |			СтруктурнаяЕдиница В (&СписокСкладов)
	               |				И НЕ ЗаказПокупателя = ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	               |				И НЕ СтруктурнаяЕдиница = ЗаказПокупателя.СтруктурнаяЕдиницаРезерв) КАК ЗапасыОстатки
	               |ГДЕ
	               |	ЗапасыОстатки.КоличествоОстаток > 0
	               |;
	               |
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Заказы.Склад КАК Склад,
	               |	ВТ_Заказы.Заказ КАК Заказ,
	               |	ВТ_Заказы.Номенклатура,
	               |	ВТ_Заказы.Количество,
	               |	ВТ_Заказы.Получатель КАК Получатель,
	               |	ВТ_Заказы.Характеристика
	               |ИЗ
	               |	ВТ_Заказы КАК ВТ_Заказы
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Склад,
	               |	Получатель,
	               |	Заказ";
	//Запрос.УстановитьПараметр("Склад",	Склад);	 //Структурная единица, Контрагент
	Запрос.УстановитьПараметр("СписокСкладов",	СписокСкладов.ВыгрузитьЗначения());	 //Структурная единица, Контрагент

	РезультатЗапроса = Запрос.Выполнить();
	//СписокПеремещений.Параметры.УстановитьЗначениеПараметра("Склад", Склад);
	Элементы.СписокПеремещений.Обновить();
	
	Заказано.Загрузить(РезультатЗапроса.Выгрузить());
	
	//учтновим склад 
	//текСтрока = Элементы.Заказано.ТекущиеДанные;
	//Если текСтрока <> Неопределено Тогда
	//	Склад = текСтрока.Склад;
	//КонецЕсли;
	
	Если Заказано.Количество() > 0 Тогда
		Склад = Заказано[0].Склад;	
	КонецЕсли;
	
	ОбновитьТаблицуОстатков();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказаноПриАктивизацииСтроки(Элемент)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	новыйПолучатель = Элемент.ТекущиеДанные.Получатель;
	новыйСклад		= Элемент.ТекущиеДанные.Склад;
 
	
	Если НЕ (новыйПолучатель = старыйПолучатель И новыйСклад = Склад) Тогда
		Получатель = новыйПолучатель;
		старыйПолучатель = новыйПолучатель;
		Склад = новыйСклад;
		
		ОбновитьТаблицуОстатков();
		
	КонецЕсли;
	
	Элементы.Остатки.ОтборСтрок = Новый ФиксированнаяСтруктура("Заказ", Элемент.ТекущиеДанные.Заказ);//_Паганини
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуОстатков()
	
	Остатки.Очистить();
	
	//массивСтрок = Заказано.НайтиСтроки(структураПоиска);
	Для Каждого текСтрока ИЗ Заказано Цикл
		текСтрока.Передать = 0;
	КонецЦикла;

	
	//получим остатки на текущем складе по 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗапасыНаСкладахОстатки.Номенклатура,
	               |	ЗапасыНаСкладахОстатки.Характеристика,
	               |	ЗапасыНаСкладахОстатки.Ячейка,
	               |	ЗапасыНаСкладахОстатки.КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ЗапасыНаСкладах.Остатки(
	               |			,
	               |			СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	               |				И Номенклатура В (&НоменклатураТекущегоЗаказчика)) КАК ЗапасыНаСкладахОстатки
	               |ГДЕ
	               |	ЗапасыНаСкладахОстатки.КоличествоОстаток > 0
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЗапасыНаСкладахОстатки.Ячейка.Код";//_Паганини
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Склад);
	Запрос.УстановитьПараметр("НоменклатураТекущегоЗаказчика", Заказано.Выгрузить().ВыгрузитьКолонку("Номенклатура"));

	РезультатЗапроса = Запрос.Выполнить();
	таблицаОстатков = РезультатЗапроса.Выгрузить();
	
	// теперь будем ити по закзам и выбирать из остатков
	
	Для Каждого текСтрока Из Заказано Цикл
		
		Если Не текСтрока.Получатель = Получатель Тогда
			Продолжить;
		КонецЕсли;
		
		НужноОтгрузить = текСтрока.Количество;
		Номенклатура = текСтрока.Номенклатура;
		Заказ = текСтрока.Заказ;
		
		// получим таблицу подходящих строк 
		массивСтрок = таблицаОстатков.НайтиСтроки(Новый Структура ("Номенклатура", Номенклатура));
		Для Каждого строкаОстатков из массивСтрок  Цикл
			
			Если строкаОстатков.КоличествоОстаток = 0 Тогда
				Продолжить;; 
			КонецЕсли;
			
			отгружаем = Мин(НужноОтгрузить, строкаОстатков.КоличествоОстаток);
			
			новаяСтрока = Остатки.Добавить();
			
			новаяСтрока.Номенклатура = Номенклатура;
			новаяСтрока.Ячейка = строкаОстатков.Ячейка;
			новаяСтрока.Остаток = отгружаем;
			новаяСтрока.Передать = отгружаем;
			новаяСтрока.Характеристика = строкаОстатков.Характеристика;
			новаяСтрока.Заказ = Заказ;

			текСтрока.Передать = текСтрока.Передать + отгружаем;
			НужноОтгрузить = НужноОтгрузить - отгружаем;
			строкаОстатков.КоличествоОстаток = строкаОстатков.КоличествоОстаток - отгружаем;
			
			Если НужноОтгрузить = 0 Тогда 
				Прервать; // уже все есть
			КонецЕсли;

			
		КонецЦикла;
		
		//// пока от пустых строк отказались
		// добьем пустыми сторками по номенклатуре
		//Для Каждого строкаОстатков Из таблицаОстатков  Цикл
		//	
		//	Если строкаОстатков.Номенклатура <> Номенклатура ИЛИ 
		//		строкаОстатков.КоличествоОстаток = 0 Тогда
		//		Продолжить;
		//	КонецЕсли;
		//	
		//	новаяСтрока = Остатки.Добавить();
		//	
		//	новаяСтрока.Номенклатура = Номенклатура;
		//	новаяСтрока.Ячейка = строкаОстатков.Ячейка;
		//	новаяСтрока.Остаток = строкаОстатков.КоличествоОстаток;
		//	новаяСтрока.Передать = 0;
		//	новаяСтрока.Характеристика = строкаОстатков.Характеристика;
		//	
		//КонецЦикла;
		
		
		
	КонецЦикла;
	
	Остатки.Сортировать("Номенклатура, Ячейка");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыПередачи(Команда)
	СоздатьДокументыПередачиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыПередачиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Товары.Ячейка,
	               |	Товары.Номенклатура,
	               |	Товары.Заказ,
	               |	Товары.Передать КАК Количество,
	               |	Товары.Характеристика,
	               |	Товары.ОК
	               |ПОМЕСТИТЬ Товары
	               |ИЗ
	               |	&Остатки КАК Товары
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Товары.Ячейка КАК Ячейка,
	               |	Товары.Номенклатура,
	               |	Товары.Заказ КАК ЗаказПокупателя,
	               |	Товары.Количество КАК Количество,
	               |	Товары.Характеристика,
	               |	Товары.Количество КАК Резерв
	               |ИЗ
	               |	Товары КАК Товары
	               |ГДЕ
	               |	Товары.ОК
	               |ИТОГИ
	               |	СУММА(Количество)
	               |ПО
	               |	Ячейка";
	Запрос.УстановитьПараметр("Остатки", Остатки.Выгрузить());
	РезультатЗапроса = Запрос.Выполнить();
	
	
	НачатьТранзакцию();
	
	обходПоЯчейкам = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Отказ = Ложь;
	
	Пока обходПоЯчейкам.Следующий() Цикл
		
		Если обходПоЯчейкам.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СоздатьИПровестиПеремещение(обходПоЯчейкам, Отказ);
		
		Если Отказ Тогда
			ОтменитьТранзакцию();
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьИПровестиПеремещение(обходПоЯчейкам, Отказ)
	
	новыйДокумент = Документы.ПеремещениеЗапасов.СоздатьДокумент();
	
	новыйДокумент.Организация = Справочники.Организации.НайтиПоКоду("00-000001"); ///!!!!!!!!!!!!!!!!
	новыйДокумент.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение;
	новыйДокумент.СтруктурнаяЕдиница = Склад;
	новыйДокумент.Ячейка = обходПоЯчейкам.Ячейка;
	новыйДокумент.СтруктурнаяЕдиницаПолучатель = Получатель;
	//новыйДокумент.ДокументОснование = ;
	//новыйДокумент.ЗаказПокупателя = текущийЗаказ;
	новыйДокумент.Автор = Пользователи.ТекущийПользователь();
	новыйДокумент.Дата = ТекущаяДата();
	новыйДокумент.ПоложениеЗаказаПокупателя = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
	
	выборка = обходПоЯчейкам.Выбрать();
	
	Пока выборка.следующий() Цикл
		
		Если выборка.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = новыйДокумент.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, выборка);
		НоваяСтрока.ЕдиницаИзмерения = выборка.Номенклатура.ЕдиницаИзмерения;
			
	КонецЦикла;
	
	Если новыйДокумент.Запасы.Количество() > 0 Тогда
		
		Попытка
			новыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки(),,,,Отказ);
		КонецПопытки;
		
	КонецЕсли;
		
	ОбновитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПеремещенийПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СписокСкладовПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры
